MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
#include <Arduino.h>
#include <IRremoteESP8266.h>
#include <IRsend.h>
#include <IRrecv.h>
#include <IRac.h>
#include <IRtext.h>
#include <IRutils.h>
#include <assert.h>
#include <FastLED.h>
#include <Wire.h>
#include "SSD1306Wire.h"
#include "OLEDDisplayUi.h"
#include <ESP8266WiFi.h>
#include <PubSubClient.h>

#define ledPin     2 //D4 The pin that Controlls the RGB LED's

#define CHIPSET     WS2811 //type of Individualy addressable LED's we use
#define NUM_LEDS    2 // currently we use 2 RGB LED's

#define idd '2'
String idstring = "000010";
String CFFA = "0001";
String CGREEN = "0010";
String CBLUE = "0011";
String CRED = "0100";
String CWHITE = "0101";
String  Cown = "0001";

int totalbullets = 0;


boolean timeout = false;

WiFiClient espClient; //libary to use wifi
PubSubClient client(espClient); //libary to use mqtt
boolean connected = false; // a variable t

const uint32_t kBaudRate = 115200; //bitrate 115200 is fairly standard in these type of projects.

const uint16_t kCaptureBufferSize = 1024; //standard settings of the IRremoteESP8266 libary 
const uint8_t kTimeout = 50;
const uint16_t kMinUnknownSize = 12;
const uint8_t kTolerancePercentage = kTolerance;  // kTolerance is normally 25%

const uint16_t kIrLed = 15;  // ESP8266 GPIO pin to use. Recommended: 4 (D2) // using 15 (D8)
const uint16_t kRecvPin = 14; // pin to receive ir data (D5)
String ownTeam = "FFA";  //Defines the basic configurgiration
SSD1306Wire display(0x3c, SDA, SCL); //configures the display (address and i²c) (the SDA = D2,  SCL = D1)
OLEDDisplayUi ui     ( &display );
CRGB leds[NUM_LEDS];
IRrecv irrecv(kRecvPin, kCaptureBufferSize, kTimeout, true);
decode_results results;  // Somewhere to store the results

IRsend irsend(kIrLed);  // Set the GPIO to be used to sending the message.

// Example of data captured by IRrecvDumpV2.ino
uint16_t MawData[] = { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 1  , 2   ,3    ,4    ,5    ,6    ,7    ,8    ,9,10,11,5600};
uint16_t rawData[] = { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 1  , 2   ,3    ,4    ,5    ,6    ,7    ,8    ,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24, 5600};
//uint16_t rawData[] =   { 1646 , 422 , 393, 393, 393, 393, 393, 393, 393, 786, 393, 786, 393, 786, 393, 786, 393, 393, 393 ,393  ,393  ,393  ,393  ,393  ,786  ,393, 393 ,393  ,393  ,393  ,393  ,393  ,786  ,393, 393 ,393  ,393  ,393  ,786 ,786  ,393  , 5600};
// binary codes of the 'legacy guns', ffa gun is not legacy
String BlueGunx1    = "00000001 00000001 00000110";
String BlueGunx2    = "00000001 00000010 00000111";
String BlueGunx3    = "00000001 00000011 00001000";
String RedGunx1     = "00000010 00000001 00000111";
String RedGunx2     = "00000010 00000010 00001000";
String RedGunx3     = "00000010 00000011 00001001";
String GreenGunx1   = "00000011 00000001 00001000";
String GreenGunx2   = "00000011 00000010 00001001";
String GreenGunx3   = "00000011 00000011 00001011";
String WhiteGunx1   = "00000100 00000001 00001001";
String WhiteGunx2   = "00000100 00000010 00001011";
String WhiteGunx3   = "00000100 00000011 00001100";
String FFAGUN       = "00000101 00000001 00001100";
//codes for the teams
String Blue   =   "001";
String Red    =   "010";
String Green  =   "011";
String White  =   "100";
String FFA    =   "101";
String eigenteam = "101";
// ammo amounts gun epending on gun type
int bullet1x = 6;
int bullet2x = 3;
int bullet3x = 1;

//setu up for default team and gun
int teams = 0;
String gun = FFAGUN;
int guns = 100;
//codes for the damage
String Damagex1   = "01";
String Damagex2   = "10";
String Damagex3   = "11";
int buzzer = 0;  //  pin D3
const uint16_t ChangeTeams_Button = 12; //d6
const uint16_t button_Shoot = 13;    // pushbutton connected to digital pin D7
int val = 0;      // variable to store the read value
const uint8_t ChangeGuns_Button = 16;//D0 button to change the gun type
const uint8_t Reload_Button = A0;//reload button on A0 
int bullets = 6;//amount of bullets for default gun
int Health = 9; //you start with 9hp
int bullet_type = bullet1x;
int time_wait = 0; //cooldown for actions
int gun_delay   = 10; //default cooldown for default gun

//wifi setup
const char* ssid = "NETGEAR";
const char* password = "";
const char* mqtt_server = "192.168.1.5";

//mqtt setup (part 1)
unsigned long lastMsg = 0;
#define MSG_BUFFER_SIZE	(50)
char msg[MSG_BUFFER_SIZE];
int value = 0;
String tempstring = Cown + Damagex1 + idstring;

//wifi loading funcion
void setup_wifi() {

  delay(10);
  // We start by connecting to a WiFi network
  Serial.println();
  Serial.print("Connecting to ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);
  WiFi.begin(ssid, password);

  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    Serial.print(".");
  }

  randomSeed(micros());

  Serial.println("");
  Serial.println("WiFi connected");
  Serial.println("IP address: ");
  Serial.println(WiFi.localIP());
}

//mqtt call back function (this function should be used to pull data from the server)
void callback(char* topic, byte* payload, unsigned int length) {
  
  Serial.print("Message arrived [");
  Serial.print(topic);
  Serial.print("] ");
  if (topic == "time"){
    snprintf (msg, MSG_BUFFER_SIZE, "%ld#%ld#%ld#%ld", idd, Health, bullets, totalbullets);
    Serial.print("Publish message: ");
    Serial.println(msg);
    client.publish("1", msg);
  }
  if (topic[0] == idd){
    String Cteam = "";
    String Cdam = "";
    Serial.println("true"); 
    Cteam.clear();
    Cdam.clear();
    switch (payload[0])
    {
    case '1':
      Cteam = CBLUE;
      leds[1] = CRGB::Blue;
      ownTeam = "CBLUE";
    case '2':
      Cteam = CRED;
      leds[1] = CRGB::Red;
      ownTeam = "CRED";
    case '3':
      Cteam = CGREEN;
      leds[1] = CRGB::Green;
      ownTeam = "CGREEN";
      
    case '4':
      Cteam = CWHITE;
      leds[1] = CRGB::White;
      ownTeam = "CWHITE";
      
    case '5':
      Cteam = CFFA;
      leds[1] = CRGB::Purple;
      ownTeam = "CFFA";
    default:
      Cteam = CFFA;
      leds[1] = CRGB::Purple;
      ownTeam = "CFFA";
    }
    switch (payload[1])
    {
    case '1':
      Cdam = Damagex1;
      bullet_type = 9;
    case '2':
      Cdam = Damagex2;
      bullet_type = 6;   
    case '3':
      Cdam = Damagex3;
      bullet_type = 3;
    default:
      Cdam = Damagex1;
      bullet_type = 9;
    }
    if (payload[3])
    {
      bullet_type = payload[3];
      if (payload[3] = '0')
      {
        bullet_type = 10;
      }
      
