MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
    }
    
    tempstring.clear();


    tempstring = Cteam + Cdam + idstring;
    String tempstring = Cown + Damagex1 + idstring;
    Serial.println(" -nice- ");
  }
}

//display functions
void msOverlay(OLEDDisplay *display, OLEDDisplayUiState* state) {
  display->setTextAlignment(TEXT_ALIGN_RIGHT);
  display->setFont(ArialMT_Plain_10);
  display->drawString(128, 0, String(millis()));
}
void drawFrame1(OLEDDisplay *display, OLEDDisplayUiState* state, int16_t x, int16_t y) {
  // draw an xbm image.
  // Please note that everything that should be transitioned
  // needs to be drawn relative to x and y
  display->setTextAlignment(TEXT_ALIGN_LEFT);
  display->setFont(ArialMT_Plain_16);
  String status = "Not connected";
  if (connected){
   status.clear();
   status.concat("Connected");
  }
  display->drawString(0 + x, 10 + y, status);

}
void drawFrame2(OLEDDisplay *display, OLEDDisplayUiState* state, int16_t x, int16_t y) {
  // draw an xbm image.
  // Please note that everything that should be transitioned
  // needs to be drawn relative to x and y

  display->setTextAlignment(TEXT_ALIGN_LEFT);
  display->setFont(ArialMT_Plain_24);
  
  String hp = "HP: ";
  hp.concat(Health);
  display->drawString(0 + x, 10 + y, hp);
 
}
void drawFrame3(OLEDDisplay *display, OLEDDisplayUiState* state, int16_t x, int16_t y) {
  // draw an xbm image.
  // Please note that everything that should be transitioned
  // needs to be drawn relative to x and y

  display->setTextAlignment(TEXT_ALIGN_LEFT);
   display->setFont(ArialMT_Plain_24);
  String team = "Team: " + ownTeam;
  display->drawString(0 + x, 10 + y, team);
  
}
void drawFrame4(OLEDDisplay *display, OLEDDisplayUiState* state, int16_t x, int16_t y) {
  // draw an xbm image.
  // Please note that everything that should be transitioned
  // needs to be drawn relative to x and y

  display->setTextAlignment(TEXT_ALIGN_LEFT);
  display->setFont(ArialMT_Plain_24);
  
  String Ammo = "Ammo: ";
  Ammo.concat(bullets);
  display->drawString(0 + x, 10 + y, Ammo);
}
//forms an array of the frames
FrameCallback frames[] = { drawFrame1, drawFrame2, drawFrame3,drawFrame4};


void setup() {
  pinMode(kIrLed, OUTPUT);
  digitalWrite(kIrLed,LOW);
  pinMode(buzzer, OUTPUT);  // sets the digital pin 15 as output
  pinMode(button_Shoot, INPUT);    // sets the digital pin 7 as input
  pinMode(ChangeGuns_Button,INPUT);
  pinMode(Reload_Button,INPUT);
  pinMode(ChangeTeams_Button, INPUT);
  irsend.begin();
  Serial.begin(115200, SERIAL_8N1, SERIAL_TX_ONLY);
  assert(irutils::lowLevelSanityCheck() == 0);
  FastLED.addLeds<WS2812B, ledPin, GRB>(leds, NUM_LEDS);
  leds[1] = CRGB::Purple;
  leds[0] = CRGB::Green;
  setup_wifi();
  client.setServer(mqtt_server, 1883);
  client.setCallback(callback);






  // Initialising the UI will init the display too.
  
  Serial.printf("\n" D_STR_IRRECVDUMP_STARTUP "\n", kRecvPin);
#if DECODE_HASH
  // Ignore messages with less than minimum on or off pulses.
  irrecv.setUnknownThreshold(kMinUnknownSize);
#endif  // DECODE_HASH
  irrecv.setTolerance(kTolerancePercentage);  // Override the default tolerance.
  irrecv.enableIRIn();  // Start the receiver



  ui.setTargetFPS(10);

  // You can change this to
  // TOP, LEFT, BOTTOM, RIGHT
  ui.setIndicatorPosition(BOTTOM);

  // Defines where the first frame is located in the bar.
  ui.setIndicatorDirection(LEFT_RIGHT);

  // You can change the transition that is used
  // SLIDE_LEFT, SLIDE_RIGHT, SLIDE_UP, SLIDE_DOWN
  ui.setFrameAnimation(SLIDE_LEFT);

  // Add frames
  ui.setFrames(frames, 4);
  ui.init();
  
}

//function to keep mqtt connection alive
void reconnect() {
  // Loop until we're reconnected
  int i = 0;
  while ((!client.connected())and(!timeout)) {
    Serial.print("Attempting MQTT connection...");
    // Create a random client ID
    String clientId = "ESP8266Client-01";
    // Attempt to connect
    if (client.connect(clientId.c_str())) {
      Serial.println("connected");
      // Once connected, publish an announcement...
      client.publish("outTopic", "hello world");
      // ... and resubscribe
      connected = true;
      client.subscribe("1 topic");
    } else {
      Serial.print("failed, rc=");
      Serial.print(client.state());
      Serial.println(" try again in 5 seconds");
      // Wait 5 seconds before retrying
      delay(5000);
      i++;
    }
    if (i > 4){
      timeout = true;
    }
  }
}

//function to output sound please change this to something less annoying
void buzzerfun(int repeat){
  int i = 0;
  while (i < repeat*2)
  {
    digitalWrite(buzzer, LOW);
    delay(5);
    digitalWrite(buzzer, HIGH);
    delay(5);
    digitalWrite(buzzer, LOW);
    delay(5);
    digitalWrite(buzzer, HIGH);
    i++;
  }
  digitalWrite(buzzer, LOW);
  
}

//change teams function
String ChangeTeams(int teams){
  teams ++;
  if (teams == 5){
    teams = 0;
    gun.clear();
    eigenteam.clear();
  }
  String temp = "";
  switch (teams)
  {
    case 0:
      leds[1] = CRGB::Purple;
      
      eigenteam = FFA;
      gun = FFAGUN;
      guns = 100;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("FFA");
      break;
    case 1:
      leds[1] = CRGB::Blue;
      eigenteam = Blue;
      gun = BlueGunx1;
      guns = 10;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("Blue");
      break;
    case 2:
      leds[1] = CRGB::Red;
      eigenteam = Red;
      gun = RedGunx1;
      guns = 20;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("Red");
      break;
    case 3:
      leds[1] = CRGB::Green;
      eigenteam = Green;
      gun = GreenGunx1;
      guns = 30;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("Green");
      break;
    case 4:
      leds[1] = CRGB::White;
      eigenteam = White;
      gun = WhiteGunx1;
      guns = 40;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("White");
      break;
    default:
      leds[1] = CRGB::Purple;
      eigenteam = FFA;
      gun = FFAGUN;
      guns = 100;
      temp = eigenteam + gun;
      ownTeam.clear();
      ownTeam.concat("FFA");
      break;
    }
    return temp;
}


void prepare_shot(String shot){ //this function prepares, and fires the shot, first it will create a string to send in binary, then it will translate the string to a raw array, wich will be send as is
  String list = "01";
  u_int i = 0;
  int array_place = 17;
  String temp = "";
  while ((i <= shot.length()) and (!connected))
  {
    if (shot.charAt(i) == list[1]){
      rawData[array_place] = 786;
      array_place++;
      temp = temp + 786;
    }
    if (shot.charAt(i) == list[0])
    {
      rawData[array_place] = 393;
      array_place++;
      temp = temp + 786;
          }
    i++;
  }
  while ((i <= shot.length())and(connected))
  {
    if (shot.charAt(i) == list[1]){
      MawData[array_place] = 786;
      array_place++;
      temp = temp + 786;
    }
    if (shot.charAt(i) == list[0])
    {
      MawData[array_place] = 393;
      array_place++;
      temp = temp + 786;
          }
    i++;
  }
    Serial.print("Shoot: ");
  Serial.println(temp);
  if (connected)
  {
    irsend.sendRaw(MawData,30,38);
  }else{  
  irsend.sendRaw(rawData,42,38);
  }
  time_wait = (10 / bullet_type)*15;
}

void get_damage(String temp){ //as the name sugests, this function stands in to calculate the received damage, it also calls the buzzer funcion for audibel feedback when shot
  if (temp == Damagex1)
  {
    Health --;
    buzzerfun(1);
  }
  if (temp == Damagex2)
  {
    Health -= 2;
    buzzerfun(2);
  }
  if (temp == Damagex3)
  {
    Health -= 3;
    buzzerfun(3);
  }
  if (Health < 1)
  {
    Serial.println("Dead");
    buzzerfun(5);
  } 
  Serial.println(Health);
  Serial.println(temp);
}
void get_damage(String temp, int enemy){ //as the name sugests, this function stands in to calculate the received damage, it also calls the buzzer funcion for audibel feedback when shot
  if (temp == Damagex1)
  {
    Health --;
    buzzerfun(1);
  }
  if (temp == Damagex2)
  {
    Health -= 2;
    buzzerfun(2);
  }
  if (temp == Damagex3)
  {
    Health -= 3;
    buzzerfun(3);
  }
  if (Health < 1)
  {
    Serial.println("Dead");
    buzzerfun(5);
  } 
  Serial.println(Health);
  Serial.println(temp);

  if (connected)
  {
    snprintf (msg, MSG_BUFFER_SIZE, "%ld#%ld#%ld#%ld#%ld", idd, Health, bullets, totalbullets,enemy);
    Serial.print("Publish message: ");
    Serial.println(msg);
    client.publish("1", msg);
  }  
}

void decodeData(uint16_t * Datass){ //this function is to "decode" the data, since it is encoded "raw"
  String binairy_code = "";
  int i = 17;
  int iteration = 1;
  Serial.print("Eigen team: ");
  if (!connected)
  {
    Serial.println(eigenteam);
    while (i<41) //this part decodes the received values to binary, the first values of the array is static, and already present in this code, the part between place 17 and 41 (not inclusive, also we are programmers: indexes start at 0)
    {
      String bin_old = binairy_code;
      uint16_t value = Datass[i]; 
      if (value > 600)
      {
        binairy_code = bin_old + "1";
      }else {
        binairy_code = bin_old + "0";
      }
      iteration++;
      i++;
      
