MyrddinoptRoodt/LaserTag_esp8266/src/main.cpp
    }
    Serial.print("code: ");
    Serial.println(binairy_code);
    Serial.print("code damage: "); //this gets a substring which contain the 'damage' digets to be printed, this will be seen again in the next short while
    Serial.println(binairy_code.substring(15,17));
    bool b = true; 
    while (b)
    {
    
      String temp = binairy_code.substring(5,8); //this gets the team value from the string
      String damage = binairy_code.substring(15,17);//this (once again) will remember the damage value
      Serial.println(damage);
      Serial.println(temp);
      if (((temp == Blue) or (temp == Red) or (temp == Green) or (temp == White)) and (temp != FFA)) 
      // if (((temp == Blue) or (temp == Red) or (temp == Green) or (temp == White)) and (temp != eigenteam) and (eigenteam != FFA)) 
      {
        if ((temp != eigenteam) and (eigenteam != FFA)){
          get_damage(binairy_code.substring(15,17));
        }
        b = false;
      }
      if (temp == FFA)
      {
        if (eigenteam == FFA)
        {
          get_damage(damage);
        }
        b = false;
      }
      b = false;
    }
  }
  else
  {
    while (i<28) //this part decodes the received values to binary, the first values of the array is static, and already present in this code, the part between place 17 and 41 (not inclusive, also we are programmers: indexes start at 0)
    {
      String bin_old = binairy_code;
      uint16_t value = Datass[i]; 
      if (value > 600)
      {
        binairy_code = bin_old + "1";
      }else {
        binairy_code = bin_old + "0";
      }
      iteration++;
      i++;
    }
    
    Serial.println(binairy_code.substring(0,4));

    String temp = binairy_code.substring(0,3);
    String damage = binairy_code.substring(4,6);
    String enemyS = binairy_code.substring(8,10);
    char enemy[4];
    enemyS.toCharArray(enemy,5);
    int meh = strtol(enemy, 0, 2);
    if (temp == Cown)
    {
      if (temp == CFFA)
      {
        get_damage(damage, meh);
      }
      
    }else{
      if (temp != CFFA){
        get_damage(damage, meh);
      }
    }
  }
}



void changeGuns (){ //function that changes the gun type, it uses the switch method
  guns ++;
  switch (teams) // guns are 'different' for each team, so it first checks what team the gun currently is part of.
  {
  case 0:
    gun.clear();
    gun = FFAGUN;
    bullets = bullet1x;
    bullet_type = bullet1x;
    break;
  case 1:
    switch (guns)
    {
    case 11:
      gun = BlueGunx2;
      bullets = bullet2x;
      bullet_type = bullet2x;
      break;
    case 12:
      gun = BlueGunx3;
      bullets = bullet3x;
      bullet_type = bullet3x;
      break;
    case 13:
      gun = BlueGunx1;
      bullets = bullet1x;
      guns = 10;
      bullet_type = bullet1x;
      break;

    default:
      guns = 10;
      bullets = bullet1x;
      gun = BlueGunx1;
      teams = 1;
      bullet_type = bullet1x;
      eigenteam = Blue;
      break;
    }
    break;
  case 2:
    switch (guns)
    {
    case 21:
      gun = BlueGunx2;
      bullets = bullet2x;
      bullet_type = bullet2x;
      break;
    case 22:
      gun = BlueGunx3;
      bullets = bullet3x;
      bullet_type = bullet3x;
      break;
    case 23:
      gun = BlueGunx1;
      bullets = bullet1x;
      bullet_type = bullet1x;
      guns = 10;
      break;

    default:
      guns = 20;
      gun = RedGunx1;
      bullets = bullet1x;
      teams = 2;
      eigenteam = Red;
      bullet_type = bullet1x;
      break;
    }
    break;
  case 3:
    switch (guns)
    {
    case 31:
      gun = GreenGunx2;
      bullets = bullet2x;
      bullet_type = bullet2x;
      break;
    case 32:
      gun = GreenGunx3;
      bullets = bullet3x;
      bullet_type = bullet3x;
      break;
    case 33:
      gun = GreenGunx1;
      bullets = bullet1x;
      bullet_type = bullet1x;
      guns = 30;
      break;

    default:
      guns = 30;
      gun = GreenGunx1;
      bullets = bullet1x;
      bullet_type = bullet1x;
      teams = 3;
      eigenteam = Green;
      break;
    }
    break;
  case 4:
    switch (guns)
    {
    case 41:
      gun = WhiteGunx2;
      bullets = bullet2x;
      bullet_type = bullet2x;
      break;
    case 42:
      bullets = bullet3x;
      gun = WhiteGunx3;
      bullet_type = bullet3x;
      break;
    case 43:
      bullets = bullet1x;
      gun = WhiteGunx1;
      guns = 40;
      bullet_type = bullet1x;
      break;

    default:
      bullets = bullet1x;
      guns = 40;
      gun = WhiteGunx1;
      teams = 4;
      eigenteam = White;
      bullet_type = bullet1x;
      break;
    }
    break;
          
  default:
    break;
  }
  
}


void loop() {

  ui.update();
  FastLED.show();
  if ((!client.connected()) and (!timeout)) {
    reconnect();
  }
   client.loop();

  
  if ((Health > 0)and(!connected)) // as long as you have health you are part of the game, when your hp is drained, the gun doesn't read inputs anymore.
  {
    //int Reload_Button_Value = digitalRead(Reload_Button);
    //Serial.println(Reload_Button_Value);
    //Serial.println(analogRead(Reload_Button));
    if (analogRead(Reload_Button) == 1024)
    {
      bullets = bullet_type;
      Serial.print("reload gun: ");
      Serial.println(bullets);
      Serial.println(analogRead(Reload_Button));
      time_wait = 40;
      

    }
    switch (Health)//just a check to change the led colour depenging on the remaining health points
    {
    case 1:
    case 2:
    case 3:
      leds[0] = CRGB::Red;
      break;
    case 4:
    case 5:
    case 6:
      leds[0] = CRGB::Orange;
      break;
    case 7:
    case 8:
    case 9:
      leds[0] = CRGB::LimeGreen;
      break;
    default:
      break;

    }
    FastLED.show();

    if (digitalRead(button_Shoot) == HIGH) //readout of pin to detect if button is pressed, and will if so run the function "gun" (aka, it fires the "laser")
    {
      if (bullets>=1){
        prepare_shot(gun);
        bullets--;
        Serial.print("Remaining bullets: ");
        Serial.println(bullets);
        buzzerfun(2);
      }
    }
    if (digitalRead(ChangeTeams_Button) == HIGH) //reads the teams pin, if the pin is high, the gun will change team, this is done by running the change teams function
    {
      Serial.println("change team");
      String tijdelijk = ChangeTeams(teams);
      teams ++;
      if (teams > 4)
      {
        teams = 0;
      }
      eigenteam = tijdelijk.substring(0,3);
      gun = tijdelijk.substring(3,tijdelijk.length());
      Serial.print("gun: ");
      Serial.println(gun);
      Serial.print("team: ");
      Serial.println(eigenteam);
      time_wait = 5; 
      
      
